--
-- $Id$
--

module( "resmng" )
svnnum("$Id$")

prop_hero_star_up = {

	[HERO_STAR_LV_1] = { ID = HERO_STAR_LV_1, StarStatus = {1,0}, StarUpPrice = nil, GrowRate = {{1.05,0.95,0.95},{0.99,1.1,0.99},{0.96,0.95,1.05},{1,1,1}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_2] = { ID = HERO_STAR_LV_2, StarStatus = {2,0}, StarUpPrice = 10, GrowRate = {{1.088,0.983,0.983},{1.022,1.137,1.022},{0.993,0.983,1.088},{1.035,1.035,1.035}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_3] = { ID = HERO_STAR_LV_3, StarStatus = {2,1}, StarUpPrice = 15, GrowRate = {{1.126,1.016,1.016},{1.054,1.174,1.054},{1.026,1.016,1.126},{1.07,1.07,1.07}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有3%"},},
	[HERO_STAR_LV_4] = { ID = HERO_STAR_LV_4, StarStatus = {2,2}, StarUpPrice = 15, GrowRate = {{1.169,1.053,1.053},{1.091,1.216,1.091},{1.063,1.053,1.169},{1.11,1.11,1.11}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有4%"},},
	[HERO_STAR_LV_5] = { ID = HERO_STAR_LV_5, StarStatus = {3,0}, StarUpPrice = 15, GrowRate = {{1.226,1.103,1.103},{1.14,1.272,1.14},{1.113,1.103,1.226},{1.163,1.163,1.163}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有5%"},},
	[HERO_STAR_LV_6] = { ID = HERO_STAR_LV_6, StarStatus = {3,1}, StarUpPrice = 40, GrowRate = {{1.293,1.161,1.161},{1.197,1.337,1.197},{1.171,1.161,1.293},{1.225,1.225,1.225}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有6%"},},
	[HERO_STAR_LV_7] = { ID = HERO_STAR_LV_7, StarStatus = {3,2}, StarUpPrice = 40, GrowRate = {{1.36,1.219,1.219},{1.254,1.402,1.254},{1.229,1.219,1.36},{1.287,1.287,1.287}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_8] = { ID = HERO_STAR_LV_8, StarStatus = {3,3}, StarUpPrice = 40, GrowRate = {{1.432,1.281,1.281},{1.315,1.472,1.315},{1.291,1.281,1.432},{1.353,1.353,1.353}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_9] = { ID = HERO_STAR_LV_9, StarStatus = {4,0}, StarUpPrice = 40, GrowRate = {{1.504,1.343,1.343},{1.376,1.542,1.376},{1.353,1.343,1.504},{1.419,1.419,1.419}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_10] = { ID = HERO_STAR_LV_10, StarStatus = {4,1}, StarUpPrice = 80, GrowRate = {{1.58,1.41,1.41},{1.441,1.616,1.441},{1.419,1.41,1.58},{1.489,1.489,1.489}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_11] = { ID = HERO_STAR_LV_11, StarStatus = {4,2}, StarUpPrice = 80, GrowRate = {{1.656,1.477,1.477},{1.506,1.69,1.506},{1.485,1.477,1.656},{1.559,1.559,1.559}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_12] = { ID = HERO_STAR_LV_12, StarStatus = {4,3}, StarUpPrice = 80, GrowRate = {{1.732,1.544,1.544},{1.571,1.764,1.571},{1.551,1.544,1.732},{1.629,1.629,1.629}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_13] = { ID = HERO_STAR_LV_13, StarStatus = {4,4}, StarUpPrice = 80, GrowRate = {{1.813,1.615,1.615},{1.64,1.843,1.64},{1.621,1.615,1.813},{1.704,1.704,1.704}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_14] = { ID = HERO_STAR_LV_14, StarStatus = {5,0}, StarUpPrice = 80, GrowRate = {{1.894,1.686,1.686},{1.709,1.922,1.709},{1.691,1.686,1.894},{1.779,1.779,1.779}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_15] = { ID = HERO_STAR_LV_15, StarStatus = {5,1}, StarUpPrice = 120, GrowRate = {{1.983,1.763,1.763},{1.784,2.008,1.784},{1.768,1.763,1.983},{1.861,1.861,1.861}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_16] = { ID = HERO_STAR_LV_16, StarStatus = {5,2}, StarUpPrice = 120, GrowRate = {{2.072,1.84,1.84},{1.859,2.094,1.859},{1.845,1.84,2.072},{1.943,1.943,1.943}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_17] = { ID = HERO_STAR_LV_17, StarStatus = {5,3}, StarUpPrice = 120, GrowRate = {{2.161,1.917,1.917},{1.934,2.18,1.934},{1.922,1.917,2.161},{2.025,2.025,2.025}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_18] = { ID = HERO_STAR_LV_18, StarStatus = {5,4}, StarUpPrice = 120, GrowRate = {{2.25,1.994,1.994},{2.009,2.266,2.009},{1.999,1.994,2.25},{2.107,2.107,2.107}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_19] = { ID = HERO_STAR_LV_19, StarStatus = {5,5}, StarUpPrice = 150, GrowRate = {{2.342,2.074,2.074},{2.087,2.355,2.087},{2.078,2.074,2.342},{2.191,2.191,2.191}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_20] = { ID = HERO_STAR_LV_20, StarStatus = {6,0}, StarUpPrice = 150, GrowRate = {{2.434,2.154,2.154},{2.165,2.444,2.165},{2.157,2.154,2.434},{2.275,2.275,2.275}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_21] = { ID = HERO_STAR_LV_21, StarStatus = {6,1}, StarUpPrice = 150, GrowRate = {{2.526,2.234,2.234},{2.243,2.533,2.243},{2.236,2.234,2.526},{2.359,2.359,2.359}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_22] = { ID = HERO_STAR_LV_22, StarStatus = {6,2}, StarUpPrice = 200, GrowRate = {{2.621,2.317,2.317},{2.324,2.626,2.324},{2.319,2.317,2.621},{2.447,2.447,2.447}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_23] = { ID = HERO_STAR_LV_23, StarStatus = {6,3}, StarUpPrice = 250, GrowRate = {{2.716,2.4,2.4},{2.405,2.719,2.405},{2.402,2.4,2.716},{2.535,2.535,2.535}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_24] = { ID = HERO_STAR_LV_24, StarStatus = {6,4}, StarUpPrice = 300, GrowRate = {{2.811,2.483,2.483},{2.486,2.812,2.486},{2.485,2.483,2.811},{2.623,2.623,2.623}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_25] = { ID = HERO_STAR_LV_25, StarStatus = {6,5}, StarUpPrice = 300, GrowRate = {{2.906,2.566,2.566},{2.567,2.905,2.567},{2.568,2.566,2.906},{2.711,2.711,2.711}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
	[HERO_STAR_LV_26] = { ID = HERO_STAR_LV_26, StarStatus = {6,6}, StarUpPrice = 300, GrowRate = {{3.001,2.649,2.649},{2.648,2.998,2.648},{2.651,2.649,3.001},{2.799,2.799,2.799}}, Detail = {"增加攻击10%","增加防御10%","增加血量10%","增加所有2%"},},
}
